{
  "projets": "Projets",
  "experience": "Expérience",
  "etudes": "Études",
  "groupes": "Équipes et Clubs",
  "references": "Références",
  "contact": "Contact",
  "apropos": "À propos",

  "index": "Acceuil",
  "index_title": "Bienvenue sur le site web personnel de William Blanchet Lafrenière. Ce site est dédié à regrouper les projets qu'il a effectués tout au long de son parcours en informatique.",

  "projets_title": "Principaux projets",
  "projets_peps_title": "PepsReservationBot",
  "projets_peps_description": "Projet personnel de réservation automatisée de terrain du PEPS de l'Université Laval. Développé en Typescript à l'aide du package Puppeteer, il permet de planifier l'exécution d'un programme permettant de réserver automatiquement un plateau de jeu à une plage horaire prédéfinie.",
  "projets_factionwar_title": "FactionWar",
  "projets_factionwar_description": "Projet de session effectué dans le cours d'analyse et conception des systèmes orientés objets (IFT-2007). Le jeu, programmé en Java, est une simulation automatique de deux armées qui se combattent sur un champ de bataille. Finaliste au concours pour remporter le prix Yves-Roy décerné à la meilleure application développée dans le cadre du cours.",
  "projets_revolvair_title": "Revolvair",
  "projets_revolvair_description": "Projet développé dans le cadre du cours de développement mobile et objets connectés. Revolvair consiste à analyser l'air du Québec à partir des données récoltées par des stations de qualité de l'air. Ce projet a remporté le premier prix du concours meilleure application mobile Revolvair.",
  "projets_taskmaster_title": "TaskMaster",
  "projets_taskmaster_description": "TaskMaster est une application qui facilite la gestion d'horaire de travail d'employés pour les entreprises. En tant que solution web complète, TaskMaster permet une meilleure organisation des effectifs. Projet développé avec React, Typescript, et Firebase en équipe de quatre personnes.",
  "projets_ciaul_title": "EEG Flappy Bird",
  "projets_ciaul_description": "Jeu Flappy Bird contrôlable depuis un électroencéphalogramme (EEG), réalisé avec l'équipe jeu du club d'intelligence artificielle de l'Université Laval.",
  "projets_infinitecraft_title": "InfiniteCraft Bot",
  "projets_infinitecraft_description": "Projet simple créé avec l'extension de navigateur Automa. Ce programme permet de jouer à InfiniteCraft automatiquement et indéfiniment.",
  "projets_gardien_title": "Gardien Legend",
  "projets_gardien_description": "Projet pratique final en équipe de deux pour un cours de jeux vidéo. Ce jeu de tir vertical en 2D, s'inspire du style arcade, avec des phases de collecte de bonus et un combat de boss intense.",
  "projets_faceflow_title": "FaceFlow",
  "projets_faceflow_description": "Projet en équipe de recherche sur la reconnaissance faciale avec TensorFlow. Programmé en Python, cette IA permet de reconnaître un visage, déceler ses caractéristiques et les classer. Précision de plus de 78% après deux jours d'entraînement.",

  "experience_title": "Expérience de travail",
  "experience_tasks": "Tâches effectuées:",
  "experience_ramq_title": "Régie de l'assurance maladie du Québec (RAMQ)",
  "experience_ramq_period": "Juin à août 2022 puis de mai à août 2024",
  "experience_ramq_alt": "Bureau de la régie de l'assurance santé du Québec",
  "experience_ramq_tasks": [
    "Réalisation d'activités de programmation sur différentes plateformes et mise en place de plusieurs niveaux d'essais",
    "Participation à l'implantation de systèmes et production de solutions informatiques",
    "Mise à jour d'infrastructures technologiques déjà existantes",
    "Collaboration aux activités reliées à la formation et au transfert de connaissances",
    "Production de la documentation technique"
  ],
  "experience_rq_title": "Revenu Québec",
  "experience_rq_period": "Mars à Août 2023",
  "experience_rq_alt": "Bureau de Revenu Québec Marly",
  "experience_rq_tasks": [
    "Planification d’un projet complet de développement d’un logiciel de comparaison de versions de composants logiciels par la création de maquettes et de récits utilisateurs à partir des besoins établis par les architectes logiciels.",
    "Réalisation du projet en collaboration avec un collègue sous la supervision des architectes",
    "Production de tests fonctionnels visant à valider l'efficacité globale du projet",
    "Mise en place des pipelines CI/CD pour automatiser le processus de développement",
    "Mise en œuvre de nouvelles fonctionnalités en réponse aux besoins évolutifs",
    "Documentation des processus de développement et de déploiement"
  ],
  "experience_cnesst_title": "Commission sur les normes, l'équité, la santé et la sécurité au travail (CNESST)",
  "experience_cnesst_period": "Juin à Août 2022",
  "experience_cnesst_alt": "Bureau de la CNESST",
  "experience_cnesst_tasks": [
    "Mise à jour et développement de la structure de gestion documentaire électronique du Service de l'aménagement et des projets immobiliers",
    "Classement des documents à l'aide du manuel de conservation des documents",
    "Propositions de modifications pertinentes en conformité avec la volonté des membres du service"
  ],

  "etudes_title": "Études",
  "etudes_ulaval_alt": "Université Laval",
  "etudes_ulaval_title": "Université Laval",
  "etudes_ulaval_degree": "Études universitaires en cours",
  "etudes_ulaval_program": "Baccalauréat en informatique",
  "etudes_ulaval_period": "2024 - 2026",
  "etudes_saintefoy_alt": "Cégep de Sainte-Foy",
  "etudes_saintefoy_title": "Cégep de Sainte-Foy",
  "etudes_saintefoy_degree": "Diplôme d'études collégiales",
  "etudes_saintefoy_program": "Technique de l'informatique: programmation web, mobile et jeux vidéo",
  "etudes_saintefoy_period": "2020 - 2023",
  "etudes_camaradiere_alt": "École secondaire La Camaradière",
  "etudes_camaradiere_title": "École secondaire La Camaradière",
  "etudes_camaradiere_degree": "Diplôme d'études secondaires",
  "etudes_camaradiere_program": "Concentration arts et technologies de l'information et communication (Arts et TIC)",
  "etudes_camaradiere_period": "2015 - 2020",

  "references_title": "Sources de références",
  "references_configuration_title": "Configuration de cette application web:",
  "references_typescript": "TypeScript (Javascript mais avec les types)",
  "references_nodejs": "Node JS (version 20.8.0 utilisée dans le projet)",
  "references_npm": "NPM (gestionnaire de dépendances du projet)",
  "references_babel": "Babel (compatibilité avec les anciens navigateurs)",
  "references_webpack": "Webpack (Regroupement des ressources de l'application en un ensemble de fichiers)",
  "references_eslint": "Eslint (Règles sur les meilleures pratiques de programmation)",
  "references_style_title": "Style des pages :",
  "references_react_bootstrap": "React Bootstrap (formatage, thèmes et styles des pages)",
  "references_particlesjs": "Particles.js (Animation de fond d'écran)",
  "references_fontawesome": "fortawesome/free-brands-svg-icons (Icônes)",
  "references_multicolor_animation": "Animation brillante multicolore (Auteur: Leandro Simões)",
  "references_deployment_title": "Déploiement:",
  "references_cloudflare": "Cloudflare Pages (moyen facile et gratuit de déployer une application web)",
  "references_cloudflare_tutorial": "Tutoriel sur le déploiement de Cloudflare Pages avec React.JS",
  "references_freedns": "FreeDNS (Gestionnaire DNS permettant l'attribution et l'utilisation de domaines gratuits et premiums)",
  "references_dependabot": "Dependabot (Mise à jour automatique des dépendances du projet)",

  "contact_title": "Me contacter",
  "contact_name_label": "Nom",
  "contact_name_placeholder": "Votre nom",
  "contact_email_label": "Email",
  "contact_email_placeholder": "Votre email",
  "contact_subject_label": "Sujet",
  "contact_subject_placeholder": "Votre sujet",
  "contact_message_label": "Message",
  "contact_message_placeholder": "Votre message",
  "contact_send_button": "Envoyer",
  "contact_invalid_name": "Nom invalide",
  "contact_invalid_email": "Email invalide",
  "contact_invalid_subject": "Sujet invalide",
  "contact_invalid_message": "Message invalide",
  "contact_success_text": "Le courriel a bien été envoyé avec succès",
  "contact_error_text": "Une erreur s'est produite, veuillez réessayer plus tard",

  "about_title": "À propos du créateur",
  "about_texts": [
    "William Blanchet Lafrenière, un passionné de l'informatique, a fait ses premiers pas dans le monde de la technologie en 2015 lorsqu'il a intégré la concentration Arts et Technologies de l'Information et de la Communication à l'École secondaire La Camaradière. Son voyage dans le domaine de l'informatique a débuté avec la création de simples sites web en HTML, CSS et JavaScript. Cependant, sa soif de connaissances et son insatiable curiosité l'ont rapidement poussé à explorer une multitude de domaines.",
    "Pendant ses années au secondaire, William a élargi ses horizons en expérimentant diverses facettes de l'informatique. Il a plongé dans l'univers du montage photo et vidéo, perfectionnant ses compétences pour donner vie à de nombreux projets visuels avec Adobe Photoshop et Illustrator. Les jeux vidéo ont également suscité son intérêt depuis un très jeune âge, et il a consacré de nombreuses heures à concevoir, développer et jouer à des jeux de toutes sortes. La modélisation 3D est un autre de ces domaines qu'il aura eu l'occasion d'explorer durant cette période. Il s'est aventuré dans l'art de créer des objets et des environnements en trois dimensions pour ensuite pouvoir imprimer certains d'entre eux en 3D. De plus, il a découvert la robotique et s'est amusé à construire et à programmer des robots qui pouvaient effectuer diverses tâches simples comme suivre un parcours puis lancer un objet d'une catapulte pour qu'il atteigne une cible. Il a également acquis des connaissances en programmation en C++ et en bases de données alors que celles-ci seront approfondies lors de sa formation collégiale.",
    "Au cours de cette formation au Cégep de Sainte Foy, il a acquis des compétences avancées en développement web, lui permettant de créer des applications web interactives et conviviales, tout en maîtrisant les dernières technologies du secteur. La cybersécurité et le hacking sont devenus des sujets d'intérêt majeur pour lui, car il s'est rendu compte de l'importance de protéger les systèmes informatiques contre les menaces en ligne. William a également eu l'opportunité de peaufiner ses connaissances en matière de création de jeux vidéo, créant à la fois des jeux complets en 2D et en 3D. Il a aussi développé des applications mobiles qui ont facilité la vie des utilisateurs, tout en perfectionnant ses compétences en matière de développement sur Android. En parallèle, il a également exploré le domaine des appareils connectés, cherchant à créer des solutions innovantes qui amélioreraient la vie quotidienne des gens.",
    "Au fil des années, William est devenu un développeur très complet et polyvalent pour son âge, capable de jongler avec une variété de langages de programmation, de technologies et de concepts complexes. Sa passion et son dévouement pour l'informatique l'ont amené à embrasser une carrière diversifiée où il peut continuer à créer, innover et résoudre des défis informatiques passionnants. Sa quête de connaissances est sans fin, et il est prêt à repousser les limites de la technologie pour façonner un avenir numérique prometteur."
  ],

  "factionwar_title": "Projet FactionWar",
  "factionwar_image1_alt": "Paramètres de Faction War",
  "factionwar_image2_alt": "Faction War en jeu",
  "factionwar_download_title": "Téléchargement",
  "factionwar_download_button": "FactionWar",

  "peps_title": "Projet PepsReservationBot",
  "peps_video_title": "Démo de PepsReservationBot",
  "peps_download_title": "Téléchargement",
  "peps_download_button": "PepsReservationBot",
  "peps_chromium_download_button": "PepsReservationBotChromium",

  "not_found": "Page non trouvée",
  "not_found_oups": "Oups !",
  "not_found_message": "La page n’a pas été trouvée",
  "not_found_lead": "La page que vous recherchez n’existe pas ou a été déplacée.",
  "not_found_button": "Retourner à l’accueil",

  "footer_text": "Créé par William Blanchet Lafrenière. Sous licence MIT, ne pas reproduire"
}