{
  "projets": "Projects",
  "experience": "Experience",
  "etudes": "Studies",
  "references": "References",
  "contact": "Contact",
  "apropos": "About",

  "index": "Home",
  "index_title": "Welcome to William Blanchet Lafrenière's personal website, dedicated to bringing together the projects he has carried out throughout his career in computer science.",

  "projets_title": "Main Projects",
  "projets_peps_title": "PepsReservationBot",
  "projets_peps_description": "Personal project for automated field reservations at PEPS at Université Laval. Developed in TypeScript using Puppeteer, it includes a PowerShell script to precisely schedule field reservations for predefined times.",
  "projets_factionwar_title": "FactionWar",
  "projets_factionwar_description": "Session project in the Object-Oriented Systems Analysis and Design course (IFT-2007). The Java-programmed game is a simulation of two armies battling on the battlefield. Finalist in the Yves-Roy prize competition for the best application developed in the course.",
  "projets_revolvair_title": "Revolvair",
  "projets_revolvair_description": "Developed for the Mobile Development and IoT course. Revolvair analyzes air quality in Quebec using data from monitoring stations. This project won first prize for best mobile app in the Revolvair competition.",
  "projets_taskmaster_title": "TaskMaster",
  "projets_taskmaster_description": "TaskMaster is a schedule manager for businesses. As a complete web solution, TaskMaster enables better workforce management. Developed with React, TypeScript, and Firebase by a team of four.",
  "projets_ciaul_title": "EEG Flappy Bird",
  "projets_ciaul_description": "Flappy Bird game controllable via an electroencephalogram (EEG), created with the game team from Université Laval's AI Club.",
  "projets_infinitecraft_title": "InfiniteCraft Bot",
  "projets_infinitecraft_description": "Simple project created using the Automa browser extension. This program automates gameplay in InfiniteCraft indefinitely.",
  "projets_gardien_title": "Gardien Legend",
  "projets_gardien_description": "Final practical project for a video game course. This 2D vertical shooter, created with Samuel René, combines arcade-style gameplay, bonus collection, and a boss battle.",
  "projets_faceflow_title": "FaceFlow",
  "projets_faceflow_description": "Team project researching facial recognition with TensorFlow. Programmed in Python, this AI can recognize faces, identify their features, and classify them into categories. The artificial intelligence achieved over 78% accuracy after two days of training.",

  "experience_title": "Work Experience",
  "experience_tasks": "Tasks performed:",
  "experience_ramq_title": "Régie de l'assurance maladie du Québec (RAMQ)",
  "experience_ramq_period": "June to August 2022 and May to August 2024",
  "experience_ramq_alt": "Office of the Québec Health Insurance Board",
  "experience_ramq_tasks": [
    "Performed programming activities on different platforms and implemented multiple testing levels",
    "Participated in system implementation and production of IT solutions",
    "Updated existing technological infrastructures",
    "Collaborated on activities related to training and knowledge transfer",
    "Produced technical documentation"
  ],
  "experience_rq_title": "Revenu Québec",
  "experience_rq_period": "March to August 2023",
  "experience_rq_alt": "Revenu Québec Marly Office",
  "experience_rq_tasks": [
    "Planned a complete project to develop software for version comparison of software components by creating mockups and user stories based on the needs established by software architects.",
    "Implemented the project in collaboration with a colleague under the supervision of architects",
    "Produced functional tests to validate the overall effectiveness of the project",
    "Set up CI/CD pipelines to automate the development process",
    "Implemented new features in response to evolving requirements",
    "Documented development and deployment processes"
  ],
  "experience_cnesst_title": "Commission for Standards, Equity, Health, and Safety at Work (CNESST)",
  "experience_cnesst_period": "June to August 2022",
  "experience_cnesst_alt": "Office of the CNESST",
  "experience_cnesst_tasks": [
    "Updated and developed the electronic document management structure for the real estate and layout service",
    "Filed documents using the document retention manual",
    "Proposed relevant modifications in line with the service members' intentions"
  ],

  "etudes_ulaval_alt": "Université Laval",
  "etudes_ulaval_title": "Université Laval",
  "etudes_ulaval_degree": "Ongoing university studies",
  "etudes_ulaval_program": "Bachelor's degree in Computer Science",
  "etudes_ulaval_period": "2024 - 2026",
  "etudes_saintefoy_alt": "Cégep de Sainte-Foy",
  "etudes_saintefoy_title": "Cégep de Sainte-Foy",
  "etudes_saintefoy_degree": "Diploma of Collegial Studies",
  "etudes_saintefoy_program": "Computer Science: Web, Mobile, and Video Game Programming",
  "etudes_saintefoy_period": "2020 - 2023",
  "etudes_camaradiere_alt": "École secondaire La Camaradière",
  "etudes_camaradiere_title": "École secondaire La Camaradière",
  "etudes_camaradiere_degree": "High School Diploma",
  "etudes_camaradiere_program": "Arts and Information Technology Concentration (Arts & ITC)",
  "etudes_camaradiere_period": "2015 - 2020",

  "references_title": "Reference sources",
  "references_configuration_title": "Application Configuration:",
  "references_typescript": "TypeScript (JavaScript but with types)",
  "references_nodejs": "Node JS (version 20.8.0 used in the project)",
  "references_npm": "NPM (project dependency manager)",
  "references_babel": "Babel (compatibility with older browsers)",
  "references_webpack": "Webpack (Bundling application resources into a single file)",
  "references_eslint": "Eslint (Rules for programming best practices)",
  "references_style_title": "Page Style:",
  "references_react_bootstrap": "React Bootstrap (page formatting, themes, and styles)",
  "references_particlesjs": "Particles.js (Background animation)",
  "references_fontawesome": "fortawesome/free-brands-svg-icons (Icons)",
  "references_multicolor_animation": "Multicolor Shiny Animation (Author: Leandro Simões)",
  "references_deployment_title": "Application Deployment:",
  "references_cloudflare": "Cloudflare Pages (an easy and free way to deploy a web application)",
  "references_cloudflare_tutorial": "Tutorial on deploying Cloudflare Pages with React.JS",
  "references_freedns": "FreeDNS (DNS manager for assigning and using free and premium domains)",
  "references_dependabot": "Dependabot (Automatically update project dependencies)",

  "contact_title": "Contact Me",
  "contact_name_label": "Name",
  "contact_name_placeholder": "Your name",
  "contact_email_label": "Email",
  "contact_email_placeholder": "Your email",
  "contact_subject_label": "Subject",
  "contact_subject_placeholder": "Your subject",
  "contact_message_label": "Message",
  "contact_message_placeholder": "Your message",
  "contact_send_button": "Send",

  "about_title": "About the Creator",
  "about_texts": [
    "William, a passionate computer enthusiast, began his journey into the world of technology in 2015 when he joined a program focused on arts and information and communication technologies. His journey into the field of computing started modestly with the creation of simple websites in HTML, CSS, and JavaScript. However, his thirst for knowledge and insatiable curiosity quickly drove him to explore a multitude of areas.",
    "During his high school years, William broadened his horizons by experimenting with various aspects of computing. He delved into the world of photo and video editing, perfecting his skills to bring numerous visual projects to life using Adobe Photoshop and Illustrator. Video games also caught his interest from a very young age, and he spent countless hours designing, developing, and playing games of all kinds. 3D modeling was another area he explored during this period, venturing into the art of creating three-dimensional objects and environments to later 3D print some of them. Additionally, he discovered robotics and enjoyed building and programming robots that could perform various simple tasks, such as following a path and launching an object from a catapult to hit a target. He also acquired programming knowledge in C++ and databases, which would later be deepened during his college education.",
    "During his studies at Cégep de Sainte Foy, he gained advanced web development skills, enabling him to create interactive and user-friendly web applications while mastering the latest industry technologies. Cybersecurity and hacking became major topics of interest to him as he realized the importance of protecting computer systems against online threats. William also had the opportunity to refine his knowledge of video game creation, developing complete 2D and 3D games. He also developed mobile applications that made users' lives easier while honing his skills in Android development. In parallel, he explored the field of connected devices, aiming to create innovative solutions that improve people's daily lives.",
    "Over the years, William has become a well-rounded and versatile developer capable of juggling a variety of programming languages, technologies, and complex concepts. His passion and dedication to computing have led him to embrace a diverse career where he can continue to create, innovate, and solve exciting computing challenges. His quest for knowledge is endless, and he is ready to push the boundaries of technology to shape a promising digital future."
  ],

  "factionwar_title": "FactionWar Project",
  "factionwar_project_title": "FactionWar Project",
  "factionwar_image1_alt": "Faction War settings",
  "factionwar_image2_alt": "Faction War in-game",
  "factionwar_download_title": "Download",
  "factionwar_download_button": "FactionWar",

  "peps_title": "PepsReservationBot Project",
  "peps_video_title": "PepsReservationBot Demo",
  "peps_download_title": "Download",
  "peps_download_button": "PepsReservationBot",
  "peps_chromium_download_button": "PepsReservationBotChromium",

  "not_found": "Page not found",
  "not_found_oups": "Oops!",
  "not_found_message": "The page was not found",
  "not_found_lead": "The page you are looking for does not exist or has been moved.",
  "not_found_button": "Return to homepage",

  "footer_text": "All rights reserved"
}