{
  "projets": "Projects",
  "experience": "Experience",
  "etudes": "Studies",
  "groupes": "Groups",
  "references": "References",
  "contact": "Contact",
  "apropos": "About",
  "index": "Home",
  "index_title": "Welcome to the personal website of William Blanchet Lafrenière. This site is dedicated to showcasing the projects he has completed throughout his journey in computer science.",
  "projets_title": "Main projects",
  "projets_peps_title": "PepsReservationBot",
  "projets_peps_description": "Personal project for automating court reservations at the PEPS of Université Laval. Developed in TypeScript using the Puppeteer package, it schedules the execution of a program to automatically reserve a game court at a predefined time slot.",
  "projets_factionwar_title": "FactionWar",
  "projets_factionwar_description": "Semester project completed in the Object-Oriented Systems Analysis and Design course (IFT-2007). The game, programmed in Java, is an automatic simulation of two armies battling on a battlefield. Finalist in the competition for the Yves-Roy Prize awarded to the best application developed as part of the course.",
  "projets_revolvair_title": "Revolvair",
  "projets_revolvair_description": "Project developed in the Mobile Development and Connected Objects course. Revolvair analyzes Quebec's air quality using data collected from air quality monitoring stations. This project won the first prize in the Revolvair Best Mobile Application competition.",
  "projets_taskmaster_title": "TaskMaster",
  "projets_taskmaster_description": "TaskMaster is an application that facilitates employee work schedule management for businesses. As a complete web solution, TaskMaster enables better workforce organization. The project was developed with React, TypeScript, and Firebase in a team of four.",
  "projets_ciaul_title": "EEG Flappy Bird",
  "projets_ciaul_description": "Flappy Bird game controlled via an electroencephalogram (EEG), created by the game team of Université Laval's Artificial Intelligence Club.",
  "projets_lolpickbanui_title": "LoL Pick and Ban UI",
  "projets_lolpickbanui_description": "User interface for managing champion selection and banning in League of Legends. Developed in React and TypeScript, this application allows users to easily select and ban champions during the drafting phase of the game.",
  "projets_battleship_title": "Battleship Game",
    "projets_battleship_description": "Classic Battleship game developed in Ocaml. This project was created as part of the programming languages course (IFT-3000) and ",
  "projets_infinitecraft_title": "InfiniteCraft Bot",
  "projets_infinitecraft_description": "Simple project created with the Automa browser extension. This program allows playing InfiniteCraft automatically and indefinitely.",
  "projets_gardien_title": "Gardien Legend",
  "projets_gardien_description": "Final hands-on project in a team of two for a video game course. This 2D vertical shooting game is inspired by the arcade style, featuring bonus collection phases and an intense boss fight.",
  "projets_faceflow_title": "FaceFlow",
  "projets_faceflow_description": "Team research project on facial recognition using TensorFlow. Programmed in Python, this AI recognizes faces, detects their features, and classifies them. Achieved over 78% accuracy after two days of training.",
  "experience_title": "Work Experience",
  "experience_tasks": "Tasks performed:",
  "experience_ramq_title": "Régie de l'assurance maladie du Québec (RAMQ)",
  "experience_ramq_period": "June to August 2022 and May to August 2024",
  "experience_ramq_alt": "Quebec Health Insurance Board office",
  "experience_ramq_tasks": [
    "Performed programming activities on various platforms and implemented multiple levels of testing.",
    "Contributed to the implementation of systems and the production of IT solutions.",
    "Updated existing technological infrastructures.",
    "Collaborated on training activities and knowledge transfer.",
    "Produced technical documentation."
  ],
  "experience_rq_title": "Revenu Québec",
  "experience_rq_period": "March to August 2023",
  "experience_rq_alt": "Revenu Québec Marly office",
  "experience_rq_tasks": [
    "Planned a complete project to develop a software for comparing software component versions by creating wireframes and user stories based on needs established by software architects.",
    "Executed the project in collaboration with a colleague under the supervision of architects.",
    "Produced functional tests to validate the project's overall effectiveness.",
    "Set up CI/CD pipelines to automate the development process.",
    "Implemented new features in response to evolving needs.",
    "Documented the development and deployment processes."
  ],
  "experience_cnesst_title": "Commission on Workplace Standards, Fairness, Health, and Safety (CNESST)",
  "experience_cnesst_period": "June to August 2022",
  "experience_cnesst_alt": "CNESST office",
  "experience_cnesst_tasks": [
    "Updated and developed the electronic document management structure for the Service of Planning and Real Estate Projects.",
    "Organized documents using the document retention manual.",
    "Proposed relevant modifications in line with the service members' goals."
  ],
  "experience_coveo_title": "Coveo",
  "experience_coveo_period": "May to August 2025",
  "experience_coveo_alt": "Coveo office",
  "experience_coveo_tasks": [
    "Participated in the redesign of web pages in React",
    "Contributed to reducing technical debt to adopt the latest technologies",
    "Implemented and executed functional and unit tests to ensure code quality",
    "Participated in various Agile meetings to discuss project progress",
    "Worked on continuous integration (CI) to improve the application deployment process",
    "Updated the project's technical documentation"
  ],
  "etudes_title": "Education",
  "etudes_ulaval_alt": "Université Laval",
  "etudes_ulaval_title": "Université Laval",
  "etudes_ulaval_degree": "Ongoing University etudes",
  "etudes_ulaval_program": "Bachelor’s Degree in Computer Science",
  "etudes_ulaval_period": "2024 - 2026",
  "etudes_saintefoy_alt": "Cégep de Sainte-Foy",
  "etudes_saintefoy_title": "Cégep de Sainte-Foy",
  "etudes_saintefoy_degree": "Diploma of College etudes",
  "etudes_saintefoy_program": "Computer Science: Web, Mobile, and Video Game Programming",
  "etudes_saintefoy_period": "2020 - 2023",
  "etudes_camaradiere_alt": "École secondaire La Camaradière",
  "etudes_camaradiere_title": "École secondaire La Camaradière",
  "etudes_camaradiere_degree": "High School Diploma",
  "etudes_camaradiere_program": "Arts and Information & Communication Technology Focus (Arts and ICT)",
  "etudes_camaradiere_period": "2015 - 2020",
  "teams": "Teams",
  "team_dynamiques_title": "Dynamiques of Cégep de Sainte-Foy - Sports-Study Tennis",
  "team_dynamiques_description": "Sports team representing Cégep de Sainte-Foy in various regional competitions.",
  "team_dynamiques_period": "Period: 2019 - 2022",
  "team_epervier_title": "Les Éperviers - Sports-Study Badminton - École Secondaire La Camaradière",
  "team_epervier_description": "Competition team participating in several regional and national tournaments governed by the RSEQ.",
  "team_epervier_period": "Period: 2016 - 2019",
  "clubs": "Clubs",
  "club_cia_title": "Laval University Artificial Intelligence Club",
  "club_cia_description": "Club about learning and participating in projects and competitions related to artificial intelligence",
  "club_cia_period": "Period: 2023 - present",
  "club_badmintonquebec_title": "Quebec Badminton Club",
  "club_badmintonquebec_description": "Badminton club offering training and competitions for all skill levels.",
  "club_badmintonquebec_period": "Period: 2024 - Present",
  "club_seigneurnaguere_title": "Seigneurs de Naguère",
  "club_seigneurnaguere_description": "Role-playing, board game and miniature club at Université Laval in Quebec.",
  "club_seigneurnaguere_period": "Period: 2023 - Present",
  "club_grimoire_title": "Le Grimoire Club",
  "club_grimoire_description": "Organization dedicated to board games, role-playing games and live-action role-playing at Cégep de Sainte-Foy.",
  "club_grimoire_period": "Period: 2019 - 2023",
  "club_tennis_ll_title": "L'Ancienne Lorette Tennis Club",
  "club_tennis_ll_description": "Tennis club offering courses and competitions for players of all ages.",
  "club_tennis_ll_period": "Period : 2017 - 2019",
  "references_title": "References",
  "references_configuration_title": "Configuration of this web application:",
  "references_typescript": "TypeScript (JavaScript with types)",
  "references_nodejs": "Node JS (version 20.8.0 used in the project)",
  "references_npm": "NPM (dependency manager for the project)",
  "references_babel": "Babel (compatibility with older browsers)",
  "references_webpack": "Webpack (bundling the application's resources into a set of files)",
  "references_eslint": "Eslint (rules for programming best practices)",
  "references_style_title": "Page styles:",
  "references_react_bootstrap": "React Bootstrap (page formatting, themes, and styles)",
  "references_particlesjs": "Particles.js (background animation)",
  "references_fontawesome": "fortawesome/free-brands-svg-icons (icons)",
  "references_multicolor_animation": "Multicolor Glow Animation (Author: Leandro Simões)",
  "references_deployment_title": "Deployment:",
  "references_cloudflare": "Cloudflare Pages (an easy and free way to deploy a web application)",
  "references_cloudflare_tutorial": "Tutorial on deploying React.JS applications with Cloudflare Pages",
  "references_freedns": "FreeDNS (DNS manager for assigning and using free and premium domains)",
  "references_dependabot": "Dependabot (automatically updates project dependencies)",
  "contact_title": "Contact Me",
  "contact_name_label": "Name",
  "contact_name_placeholder": "Your name",
  "contact_email_label": "Email",
  "contact_email_placeholder": "Your email",
  "contact_subject_label": "Subject",
  "contact_subject_placeholder": "Your subject",
  "contact_message_label": "Message",
  "contact_message_placeholder": "Your message",
  "contact_send_button": "Send",
  "contact_invalid_name": "Invalid name",
  "contact_invalid_email": "invalid email",
  "contact_invalid_subject": "Invalid subject",
  "contact_invalid_message": "Invalid message",
  "contact_success_text": "The email has been sent successfully",
  "contact_error_text": "An error has occurred, please try again later",
  "about_title": "About the Creator",
  "about_texts": [
    "William Blanchet Lafrenière, a computer science enthusiast, began his journey in technology in 2015 when he joined the Arts and Information & Communication Technology Focus program at École secondaire La Camaradière. His foray into computer science started with building simple websites in HTML, CSS, and JavaScript. However, his thirst for knowledge and insatiable curiosity quickly pushed him to explore various domains.",
    "During his high school years, William broadened his horizons by experimenting with various facets of computing. He delved into the world of photo and video editing, honing his skills to bring many visual projects to life with Adobe Photoshop and Illustrator. Video games also piqued his interest from a very young age, and he has devoted many hours to designing, developing and playing games of all kinds. 3D modeling was another area he explored during this period. He ventured into the art of creating three-dimensional objects and environments, and then printing some of them in 3D. In addition, he discovered robotics and had fun building and programming robots that could perform a variety of simple tasks, such as following a path and then launching an object from a catapult to hit a target. He also acquired knowledge of C++ programming and databases, which will be further developed during his college training",
    "During this training at Cégep de Sainte Foy, he acquired advanced skills in web development, enabling him to create interactive, user-friendly web applications, while mastering the latest technologies in the sector. Cybersecurity and hacking became subjects of major interest to him, as he realized the importance of protecting computer systems from online threats. William also had the opportunity to hone his skills in video game creation, creating both full 2D and 3D games. He also developed mobile applications that made life easier for users, while honing his Android development skills. At the same time, he also explored the field of connected devices, seeking to create innovative solutions that would improve people's daily lives.",
    "Over the years, William has become a very well-rounded and versatile developer for his age, able to juggle a variety of programming languages, technologies and complex concepts. His passion and dedication to computing has led him to embrace a diverse career where he can continue to create, innovate and solve exciting computing challenges. His quest for knowledge is endless, and he's ready to push the boundaries of technology to shape a promising digital future."
  ],
  "demo_title": "Demo",
  "game_preview_title": "Game Preview",
  "download_title": "Download",
  "flapeeg_title": "FlapEEG Project",
  "flapeeg_video_title": "FlapEEG Demo",
  "factionwar_title": "FactionWar Project",
  "factionwar_image1_alt": "Faction War Parameters",
  "factionwar_image2_alt": "Faction War in game",
  "peps_title": "PepsReservationBot Project",
  "peps_video_title": "Démo de PepsReservationBot",
  "peps_chromium_download_title": "PepsReservationBotChromium",
  "not_found": "Page Not Found",
  "not_found_oups": "Oops!",
  "not_found_message": "The page could not be found",
  "not_found_lead": "The page you are looking for does not exist or has been moved.",
  "not_found_button": "Return to Home",
  "footer_text": "Created by William Blanchet Lafrenière. Do no reproduce"
}